# ColorSelectionDialog Properties

---
The ColorSelectionDialog type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| OriginalColor|  The original color.
| SelectedColor|  The new color selected by the user.
Top
#### Reference
ColorSelectionDialog Class
Autodesk.Revit.UI Namespace